FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/АРМЖурналЗаказНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРМЖурналЗаказНарядов</Name>
			<Comment>АРМ Журнал заказ-нарядов</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ПеремещениеНезавершенногоПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеНезавершенногоПроизводства</Name>
			<Comment>Перемещение незавершенного производства между заказ-нарядами</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВПроизводстве</xr:Item>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровКомпании</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ГТДПартийТоваровКомпании</xr:Item>
				<xr:Item>InformationRegister.ДопроведениеПоПартиям</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.МаркировкаТоваровВПроизводстве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, породивший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Идентификатор юридического лица от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Comment>Флаг отражения документа в регламентированном учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыУпр</Name>
					<Comment>Курс валюты управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Comment>Цех, из которого производиться перемещение деталей</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Comment>Заказ-наряд получатель</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехПолучатель</Name>
					<Comment>Цех, на который производиться перемещение деталей</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Детали, перемещаемые из производства</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Деталь, перемещаемая из производства</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество перемещаемых деталей</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Comment>Партия, с которой будет списан товар</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТД</Name>
							<Comment>Номер грузовой таможенной декларации (для товаров поступивших по импорту)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировкиBase64</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/АРМЖурналЗаказНарядов/Ext/ObjectModule.bsl
// Модуль обработки АРМЖурналЗаказНарядов

Перем Права Экспорт; // права пользователя

// Поиск клиента и автомобиля в источниках, заданных параметрами поиска
// Параметры:
//  СтрокаПоиска - Строка -  содержимое поискового запроса пользователя
// 	РасширенныйПоиск - Булево - Если истина - значит поиск осуществляется в соответствии со всеми настройками
//								с учетом флагов, ложь - поиск везде, флаги ограничений игнорируются
//  СтруктураНастройкиПоиска - Структура - Структура источников поиска
Функция ПоискДокументов(СтрокаПоиска,РасширенныйПоиск,СтруктураНастройкиПоиска=Неопределено) Экспорт
	
	//источники поиска
	НаименованиеКлиента = Истина;
	КонтактнаяИнформация = Истина; 
	ГосНомер = Истина; 
	VIN = Истина; 
	НомерКарты = Истина; 
	
	Если ТипЗнч(СтруктураНастройкиПоиска) = Тип("ТаблицаЗначений") И РасширенныйПоиск Тогда
		НаименованиеКлиента = СтруктураНастройкиПоиска.Найти("НаименованиеКлиента","Параметр").Значение;
		КонтактнаяИнформация = СтруктураНастройкиПоиска.Найти("КонтактнаяИнформация","Параметр").Значение; 
		ГосНомер = СтруктураНастройкиПоиска.Найти("ГосНомер","Параметр").Значение; 
		VIN = СтруктураНастройкиПоиска.Найти("VIN","Параметр").Значение; 
		НомерКарты = СтруктураНастройкиПоиска.Найти("НомерКарты","Параметр").Значение; 
		НомерДокумента = СтруктураНастройкиПоиска.Найти("НомерДокумента","Параметр").Значение; 
	КонецЕсли;
	
	ЗапросНаименованиеКлиента =	"
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Заказчик.Наименование ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Заказчик.Наименование ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|	ИЛИ ЗаявкаНаРемонт.Заказчик ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|";
								
	ЗапросКонтактнаяИнформация = "
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Заказчик В (ВЫБРАТЬ ОбъектыКИ.Объект ИЗ	ОбъектыКИ КАК ОбъектыКИ)
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Заказчик В (ВЫБРАТЬ ОбъектыКИ.Объект ИЗ	ОбъектыКИ КАК ОбъектыКИ)
		|	ИЛИ ВЫРАЗИТЬ(ЗаявкаНаРемонт.ПредставлениеТелефона КАК Строка(50)) ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|";
		
	ЗапросГосНомер = "
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Автомобиль В (
		|		ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних(, Значение ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|				И ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)
		|			) КАК АвтомобилиСрезПоследних
		|	)
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Автомобиль В (
		|		ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних(, Значение ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|				И ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)
		|			) КАК АвтомобилиСрезПоследних
		|	)
		|	ИЛИ ЗаявкаНаРемонт.Автомобиль ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ВЫРАЗИТЬ(ЗаявкаНаРемонт.ГосНомер КАК Строка(50)) ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|";
		
	//Внимание: поиск по карте осуществляется по ее владельцу
	ЗапросНомерКарты = "
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Заказчик В (
		|		ВЫБРАТЬ
		|			ШтрихКоды.Объект
		|		ИЗ
		|			РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|		ГДЕ
		|			ШтрихКоды.ШтрихКод ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|	)
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Заказчик В (
		|		ВЫБРАТЬ
		|			ШтрихКоды.Объект
		|		ИЗ
		|			РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|		ГДЕ
		|			ШтрихКоды.ШтрихКод ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|	)
		|";
				   
	ЗапросVIN = "
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Автомобиль.VIN ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Автомобиль.VIN ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|	ИЛИ ЗаявкаНаРемонт.Автомобиль ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|";

	ЗапросОбъединить = "
		|ОБЪЕДИНИТЬ
		|";  				   
				   
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			КонтактнаяИнформация.Объект КАК Объект
		|		ПОМЕСТИТЬ 
		|			ОбъектыКИ
		|		ИЗ
		|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ГДЕ
		|			КонтактнаяИнформация.Представление ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|	;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|   НайденныеДокументы.ДокументСсылка КАК ДокументСсылка
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументов
		|ИЗ
		|	(";
	
	ЭтоПервыйФрагмент = Истина;
	ЗапросПустой = Истина;
	
	Если НаименованиеКлиента Тогда
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросНаименованиеКлиента;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросНаименованиеКлиента;
		КонецЕсли;
	КонецЕсли;
	
	Если КонтактнаяИнформация Тогда 
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросКонтактнаяИнформация;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросКонтактнаяИнформация;
		КонецЕсли;
	КонецЕсли;
		
	Если ГосНомер Тогда 			  
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросГосНомер;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросГосНомер;
		КонецЕсли;
	КонецЕсли;
	
	Если VIN Тогда 			  
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросVIN;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросVIN;
		КонецЕсли;
	КонецЕсли;
		
	Если НомерКарты Тогда 			  
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросНомерКарты;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросНомерКарты;
		КонецЕсли;
	КонецЕсли;
	
	// пустой текст запроса означает, что сняты все флажки в параметрах поиска
	Если ЗапросПустой И (НЕ НомерДокумента) Тогда
		Сообщить("Не заданы параметры поиска. Проверьте настройки поиска!");
		Возврат Неопределено;
	ИначеЕсли ЗапросПустой Тогда
		//Эмуляция того, что на первом этапе поиска ничего не найдено
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Ссылка<>ЗаказНаряд.Ссылка
		|";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = ТекстЗапроса + ") КАК НайденныеДокументы
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|   НайденныеДокументыВсего.ДокументСсылка КАК ДокументСсылка
		|ИЗ
		|	(
		|
		|//Собственно сами ЗН и ЗнР, отобранные на первом этапе
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДокументов.ДокументСсылка КАК ДокументСсылка
		|ИЗ
		|	ВременнаяТаблицаДокументов КАК ВременнаяТаблицаДокументов
		|
		|ОБЪЕДИНИТЬ
		|
		|//ЗН, у которых искомый номер
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЛОЖЬ
		|"+?(НомерДокумента,"ИЛИ ЗаказНаряд.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|
		|ОБЪЕДИНИТЬ
		|
		|//ЗнР, у которых искомый номер
		|ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЛОЖЬ
		|"+?(НомерДокумента,"ИЛИ ЗаявкаНаРемонт.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|
		|ОБЪЕДИНИТЬ
		|
		|//ЗН, у которого документ-основание ЗнР с искомым номером
		|ВЫБРАТЬ
		|	ПодчиненныйДокумент.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ПодчиненныйДокумент
		|ГДЕ
		|	ПодчиненныйДокумент.ДокументОснование В (
		|		ВЫБРАТЬ
		|			ЗаявкаНаРемонт.Ссылка КАК ДокументСсылка
		|		ИЗ
		|			Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|		ГДЕ
		|			ЛОЖЬ
		|			"+?(НомерДокумента,"ИЛИ ЗаявкаНаРемонт.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|	)
		|
		|ОБЪЕДИНИТЬ
		|
		|//ЗнР, у которого есть подчиненный ЗН с искомым номером
		|ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Ссылка В (
		|		ВЫБРАТЬ
		|			ЗаказНаряд.ДокументОснование КАК ДокументСсылка
		|		ИЗ
		|			Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ГДЕ
		|			ЛОЖЬ
		|			"+?(НомерДокумента,"ИЛИ ЗаказНаряд.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|	)
		|
		|ОБЪЕДИНИТЬ
		|
		|//Перемещение товаров в производство, у которых искомый номер или основание из уже отобранных ЗН на первом этапе
		|ВЫБРАТЬ
		|	ПодчиненныйДокумент.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ПеремещениеТоваровВПроизводство КАК ПодчиненныйДокумент
		|ГДЕ
		|	ПодчиненныйДокумент.ДокументОснование В (
		|		ВЫБРАТЬ
		|			ВременнаяТаблицаДокументов.ДокументСсылка КАК ДокументСсылка
		|		ИЗ
		|			ВременнаяТаблицаДокументов КАК ВременнаяТаблицаДокументов
		|	)
		|"+?(НомерДокумента,"ИЛИ ПодчиненныйДокумент.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%"" ИЛИ ПодчиненныйДокумент.ДокументОснование.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|
		|ОБЪЕДИНИТЬ
		|
		|//Извлечение товаров из производства, у которых искомый номер или основание из уже отобранных ЗН на первом этапе
		|ВЫБРАТЬ
		|	ПодчиненныйДокумент.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ИзвлечениеТоваровИзПроизводства КАК ПодчиненныйДокумент
		|ГДЕ
		|	ПодчиненныйДокумент.ДокументОснование В (
		|		ВЫБРАТЬ
		|			ВременнаяТаблицаДокументов.ДокументСсылка КАК ДокументСсылка
		|		ИЗ
		|			ВременнаяТаблицаДокументов КАК ВременнаяТаблицаДокументов
		|	)
		|"+?(НомерДокумента,"ИЛИ ПодчиненныйДокумент.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%"" ИЛИ ПодчиненныйДокумент.ДокументОснование.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|
		|ОБЪЕДИНИТЬ
		|
		|//Акт разногласий, у которых искомый номер или основание из уже отобранных ЗН на первом этапе
		|ВЫБРАТЬ
		|	ПодчиненныйДокумент.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.АктРазногласий КАК ПодчиненныйДокумент
		|ГДЕ
		|	ПодчиненныйДокумент.ДокументОснование В (
		|		ВЫБРАТЬ
		|			ВременнаяТаблицаДокументов.ДокументСсылка КАК ДокументСсылка
		|		ИЗ
		|			ВременнаяТаблицаДокументов КАК ВременнаяТаблицаДокументов
		|	)
		|"+?(НомерДокумента,"ИЛИ ПодчиненныйДокумент.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%"" ИЛИ ПодчиненныйДокумент.ДокументОснование.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|
		|ОБЪЕДИНИТЬ
		|
		|//Ввод остатоков товаров в производстве, у которых искомый номер или основание из уже отобранных ЗН на первом этапе
		|ВЫБРАТЬ
		|	ПодчиненныйДокумент.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ВводОстатковТоваровВПроизводстве КАК ПодчиненныйДокумент
		|ГДЕ
		|	ПодчиненныйДокумент.ДокументОснование В (
		|		ВЫБРАТЬ
		|			ВременнаяТаблицаДокументов.ДокументСсылка КАК ДокументСсылка
		|		ИЗ
		|			ВременнаяТаблицаДокументов КАК ВременнаяТаблицаДокументов
		|	)
		|"+?(НомерДокумента,"ИЛИ ПодчиненныйДокумент.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%"" ИЛИ ПодчиненныйДокумент.ДокументОснование.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|
		|ОБЪЕДИНИТЬ
		|
		|//Разукомплектация автомобилей, у которых искомый номер или основание из уже отобранных ЗН на первом этапе
		|ВЫБРАТЬ
		|	ПодчиненныйДокумент.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.РазукомплектацияАвтомобилей КАК ПодчиненныйДокумент
		|ГДЕ
		|	ПодчиненныйДокумент.ДокументОснование В (
		|		ВЫБРАТЬ
		|			ВременнаяТаблицаДокументов.ДокументСсылка КАК ДокументСсылка
		|		ИЗ
		|			ВременнаяТаблицаДокументов КАК ВременнаяТаблицаДокументов
		|	)
		|"+?(НомерДокумента,"ИЛИ ПодчиненныйДокумент.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%"" ИЛИ ПодчиненныйДокумент.ДокументОснование.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|
		|ОБЪЕДИНИТЬ
		|
		|//Перемещение незавершенного производства, у которых искомый номер или основание из уже отобранных ЗН на первом этапе
		|ВЫБРАТЬ
		|	ПодчиненныйДокумент.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ПеремещениеНезавершенногоПроизводства КАК ПодчиненныйДокумент
		|ГДЕ
		|	ПодчиненныйДокумент.ДокументОснование В (
		|		ВЫБРАТЬ
		|			ВременнаяТаблицаДокументов.ДокументСсылка КАК ДокументСсылка
		|		ИЗ
		|			ВременнаяТаблицаДокументов КАК ВременнаяТаблицаДокументов
		|	)
		|"+?(НомерДокумента,"ИЛИ ПодчиненныйДокумент.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%"" ИЛИ ПодчиненныйДокумент.ДокументОснование.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|
		|ОБЪЕДИНИТЬ
		|
		|//Перемещение незавершенного производства, у которых ЗН-приемник из уже отобранных ЗН на первом этапе
		|ВЫБРАТЬ
		|	ПодчиненныйДокумент.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ПеремещениеНезавершенногоПроизводства КАК ПодчиненныйДокумент
		|ГДЕ
		|	ПодчиненныйДокумент.ЗаказНаряд В (
		|		ВЫБРАТЬ
		|			ВременнаяТаблицаДокументов.ДокументСсылка КАК ДокументСсылка
		|		ИЗ
		|			ВременнаяТаблицаДокументов КАК ВременнаяТаблицаДокументов
		|	)
		|"+?(НомерДокумента,"ИЛИ ПодчиненныйДокумент.ЗаказНаряд.Номер ПОДОБНО ""%"" + &СтрокаПоиска + ""%""","")+"
		|
		|) КАК НайденныеДокументыВсего";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СтрокаПоиска",СтрокаПоиска);
	
	//ДокументыТЗ = Новый ТаблицаЗначений;
	ДокументыТЗ = Запрос.Выполнить().Выгрузить();
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.ЗагрузитьЗначения(ДокументыТЗ.ВыгрузитьКолонку("ДокументСсылка"));
	Возврат СписокДокументов;
КонецФункции

Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
